; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-35)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
(at ball34 room5)
(at ball35 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room3)
(at ball31 room3)
(at ball32 room3)
(at ball33 room3)
(at ball34 room3)
(at ball35 room3)
)
)
)

; plan
1. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 6 of 35
2. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 6 of 35
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 6 of 35
4. (drop ball6 room3 right)
   deleted: (carry ball6 right)
   added: (at ball6 room3) (free right)
   goals met: 7 of 35
5. (drop ball7 room3 left)
   deleted: (carry ball7 left)
   added: (at ball7 room3) (free left)
   goals met: 8 of 35
6. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 8 of 35
7. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 8 of 35
8. (pick ball8 roomb right)
   deleted: (at ball8 roomb) (free right)
   added: (carry ball8 right)
   goals met: 8 of 35
9. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 8 of 35
10. (drop ball8 room3 right)
   deleted: (carry ball8 right)
   added: (at ball8 room3) (free right)
   goals met: 9 of 35
11. (drop ball9 room3 left)
   deleted: (carry ball9 left)
   added: (at ball9 room3) (free left)
   goals met: 10 of 35
12. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 10 of 35
13. (pick ball11 roomb left)
   deleted: (at ball11 roomb) (free left)
   added: (carry ball11 left)
   goals met: 10 of 35
14. (pick ball10 roomb right)
   deleted: (at ball10 roomb) (free right)
   added: (carry ball10 right)
   goals met: 10 of 35
15. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 10 of 35
16. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 10 of 35
17. (drop ball10 room3 right)
   deleted: (carry ball10 right)
   added: (at ball10 room3) (free right)
   goals met: 11 of 35
18. (drop ball11 room3 left)
   deleted: (carry ball11 left)
   added: (at ball11 room3) (free left)
   goals met: 12 of 35
19. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 12 of 35
20. (pick ball35 room5 left)
   deleted: (at ball35 room5) (free left)
   added: (carry ball35 left)
   goals met: 12 of 35
21. (pick ball34 room5 right)
   deleted: (at ball34 room5) (free right)
   added: (carry ball34 right)
   goals met: 12 of 35
22. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 12 of 35
23. (drop ball34 room3 right)
   deleted: (carry ball34 right)
   added: (at ball34 room3) (free right)
   goals met: 13 of 35
24. (drop ball35 room3 left)
   deleted: (carry ball35 left)
   added: (at ball35 room3) (free left)
   goals met: 14 of 35
25. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 14 of 35
26. (pick ball33 room5 left)
   deleted: (at ball33 room5) (free left)
   added: (carry ball33 left)
   goals met: 14 of 35
27. (pick ball32 room5 right)
   deleted: (at ball32 room5) (free right)
   added: (carry ball32 right)
   goals met: 14 of 35
28. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 14 of 35
29. (drop ball32 room3 right)
   deleted: (carry ball32 right)
   added: (at ball32 room3) (free right)
   goals met: 15 of 35
30. (drop ball33 room3 left)
   deleted: (carry ball33 left)
   added: (at ball33 room3) (free left)
   goals met: 16 of 35
31. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 16 of 35
32. (pick ball31 room5 left)
   deleted: (at ball31 room5) (free left)
   added: (carry ball31 left)
   goals met: 16 of 35
33. (pick ball30 room5 right)
   deleted: (at ball30 room5) (free right)
   added: (carry ball30 right)
   goals met: 16 of 35
34. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 16 of 35
35. (drop ball30 room3 right)
   deleted: (carry ball30 right)
   added: (at ball30 room3) (free right)
   goals met: 17 of 35
36. (drop ball31 room3 left)
   deleted: (carry ball31 left)
   added: (at ball31 room3) (free left)
   goals met: 18 of 35
37. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 18 of 35
38. (pick ball29 room5 left)
   deleted: (at ball29 room5) (free left)
   added: (carry ball29 left)
   goals met: 18 of 35
39. (pick ball28 room5 right)
   deleted: (at ball28 room5) (free right)
   added: (carry ball28 right)
   goals met: 18 of 35
40. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 18 of 35
41. (drop ball28 room3 right)
   deleted: (carry ball28 right)
   added: (at ball28 room3) (free right)
   goals met: 19 of 35
42. (drop ball29 room3 left)
   deleted: (carry ball29 left)
   added: (at ball29 room3) (free left)
   goals met: 20 of 35
43. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 20 of 35
44. (pick ball27 room5 left)
   deleted: (at ball27 room5) (free left)
   added: (carry ball27 left)
   goals met: 20 of 35
45. (pick ball26 room5 right)
   deleted: (at ball26 room5) (free right)
   added: (carry ball26 right)
   goals met: 20 of 35
46. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 20 of 35
47. (drop ball26 room3 right)
   deleted: (carry ball26 right)
   added: (at ball26 room3) (free right)
   goals met: 21 of 35
48. (drop ball27 room3 left)
   deleted: (carry ball27 left)
   added: (at ball27 room3) (free left)
   goals met: 22 of 35
49. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 22 of 35
50. (pick ball25 room5 left)
   deleted: (at ball25 room5) (free left)
   added: (carry ball25 left)
   goals met: 22 of 35
51. (pick ball24 room5 right)
   deleted: (at ball24 room5) (free right)
   added: (carry ball24 right)
   goals met: 22 of 35
52. (move room5 room3)
   deleted: (at-robby room5)
   added: (at-robby room3)
   goals met: 22 of 35
53. (drop ball24 room3 right)
   deleted: (carry ball24 right)
   added: (at ball24 room3) (free right)
   goals met: 23 of 35
54. (drop ball25 room3 left)
   deleted: (carry ball25 left)
   added: (at ball25 room3) (free left)
   goals met: 24 of 35
55. (move room3 room5)
   deleted: (at-robby room3)
   added: (at-robby room5)
   goals met: 24 of 35
56. (pick ball23 room5 left)
   deleted: (at ball23 room5) (free left)
   added: (carry ball23 left)
   goals met: 24 of 35
57. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 24 of 35
58. (pick ball22 room4 right)
   deleted: (at ball22 room4) (free right)
   added: (carry ball22 right)
   goals met: 24 of 35
59. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 24 of 35
60. (drop ball22 room3 right)
   deleted: (carry ball22 right)
   added: (at ball22 room3) (free right)
   goals met: 25 of 35
61. (drop ball23 room3 left)
   deleted: (carry ball23 left)
   added: (at ball23 room3) (free left)
   goals met: 26 of 35
62. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 26 of 35
63. (pick ball21 room4 left)
   deleted: (at ball21 room4) (free left)
   added: (carry ball21 left)
   goals met: 26 of 35
64. (pick ball20 room4 right)
   deleted: (at ball20 room4) (free right)
   added: (carry ball20 right)
   goals met: 26 of 35
65. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 26 of 35
66. (drop ball20 room3 right)
   deleted: (carry ball20 right)
   added: (at ball20 room3) (free right)
   goals met: 27 of 35
67. (drop ball21 room3 left)
   deleted: (carry ball21 left)
   added: (at ball21 room3) (free left)
   goals met: 28 of 35
68. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 28 of 35
69. (pick ball19 room4 left)
   deleted: (at ball19 room4) (free left)
   added: (carry ball19 left)
   goals met: 28 of 35
70. (pick ball18 room4 right)
   deleted: (at ball18 room4) (free right)
   added: (carry ball18 right)
   goals met: 28 of 35
71. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 28 of 35
72. (drop ball18 room3 right)
   deleted: (carry ball18 right)
   added: (at ball18 room3) (free right)
   goals met: 29 of 35
73. (drop ball19 room3 left)
   deleted: (carry ball19 left)
   added: (at ball19 room3) (free left)
   goals met: 30 of 35
74. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 30 of 35
75. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 30 of 35
76. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 30 of 35
77. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 30 of 35
78. (drop ball4 room3 right)
   deleted: (carry ball4 right)
   added: (at ball4 room3) (free right)
   goals met: 31 of 35
79. (drop ball5 room3 left)
   deleted: (carry ball5 left)
   added: (at ball5 room3) (free left)
   goals met: 32 of 35
80. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 32 of 35
81. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 32 of 35
82. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 32 of 35
83. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 32 of 35
84. (drop ball2 room3 right)
   deleted: (carry ball2 right)
   added: (at ball2 room3) (free right)
   goals met: 33 of 35
85. (drop ball3 room3 left)
   deleted: (carry ball3 left)
   added: (at ball3 room3) (free left)
   goals met: 34 of 35
86. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 34 of 35
87. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 34 of 35
88. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 34 of 35
89. (drop ball1 room3 left)
   deleted: (carry ball1 left)
   added: (at ball1 room3) (free left)
   goals met: 35 of 35
